In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [['sujit',10],['omkar',20],['akshat',],['gaurav',25],['vrushabh',]]

df = pd.DataFrame(data,columns=['names','number'])

In [3]:
df

      names  number
0     sujit    10.0
1     omkar    20.0
2    akshat     NaN
3    gaurav    25.0
4  vrushabh     NaN

In [4]:
df.describe()

          number
count   3.000000
mean   18.333333
std     7.637626
min    10.000000
25%    15.000000
50%    20.000000
75%    22.500000
max    25.000000

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
df.isnull()#True indicates null value

   names  number
0  False   False
1  False   False
2  False    True
3  False   False
4  False    True

In [7]:
df.isnull().sum()

names     0
number    2
dtype: int64

In [8]:
df.columns

Index(['names', 'number'], dtype='object')

In [9]:
[features for features in df.columns if df[features].isnull().sum()>0]#To check

['number']

# Replacing null values with Mean

In [10]:
df['number'].mean()

18.333333333333332

In [11]:
df2=df['number'].replace(np.NaN,df['number'].mean())#replaces the null values into means

In [12]:
df#before Manipilation

      names  number
0     sujit    10.0
1     omkar    20.0
2    akshat     NaN
3    gaurav    25.0
4  vrushabh     NaN

In [13]:
df2#after manipulation

0    10.000000
1    20.000000
2    18.333333
3    25.000000
4    18.333333
Name: number, dtype: float64

# Replacing null values with Median

In [14]:
df['number'].median()

20.0

In [15]:
df

      names  number
0     sujit    10.0
1     omkar    20.0
2    akshat     NaN
3    gaurav    25.0
4  vrushabh     NaN

In [16]:
df3 = df['number'].replace(np.NaN,df['number'].median())

In [17]:
df3

0    10.0
1    20.0
2    20.0
3    25.0
4    20.0
Name: number, dtype: float64

Replaced with medians

# Replace with Mode

As in our dataframe there are very few records and repeatative values are missing we will create another dataframe

In [18]:
data2 = [['sujit',10],['omkar',20],['akshat',10],['gaurav',],['vrushabh',],['deeps',10],['akshada',20]]

dff = pd.DataFrame(data2,columns=['names','number'])

In [19]:
dff

      names  number
0     sujit    10.0
1     omkar    20.0
2    akshat    10.0
3    gaurav     NaN
4  vrushabh     NaN
5     deeps    10.0
6   akshada    20.0

In [20]:
dff['number'].mode()

0    10.0
dtype: float64

Since 10 is has repeated more number of times

In [21]:
df4=dff['number'].replace(np.NaN,dff['number'].mode)

In [22]:
df4

0                                                 10.0
1                                                 20.0
2                                                 10.0
3    <bound method Series.mode of 0    10.0\n1    2...
4    <bound method Series.mode of 0    10.0\n1    2...
5                                                 10.0
6                                                 20.0
Name: number, dtype: object

In [30]:
# df5=dff.fillna(dff['number'].mode())

In [ ]:
Still there are multiple ways to treat a null values-

1. Drop that column if that particular column is not important.
2. Assigning an Unique catagory.
3. Predicting the missing values using LenearRegression.
4. Using an Algorithms which supports missing values.
      : KNN
      : Random Forest